fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Начисление</name>
    <type>
      <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_График</schedule>
  <scheduleValue>InformationRegister.ВКМ_График.Resource.РабочийДень</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_График.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированнойПремии/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Движения.ВКМ_ДополнительныеНачисления.Очистить();
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		
		Движения.ВКМ_Удержания.Очистить();
		Движения.ВКМ_Удержания.Записать();
		Движения.ВКМ_Удержания.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСотрудники.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_НачислениеФиксированнойПремииСотрудники.СуммаПремии) КАК СуммаПремии
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.Сотрудники КАК ВКМ_НачислениеФиксированнойПремииСотрудники
		|ГДЕ
		|	ВКМ_НачислениеФиксированнойПремииСотрудники.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_НачислениеФиксированнойПремииСотрудники.Сотрудник";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// регистр ВКМ_ДополнительныеНачисления
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = Начисление;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ДатаНачалаПериодаДействия;
			Движение.ПериодДействияКонец = КонецДня(ДатаОкончанияПериодаДействия);
			Движение.БазовыйПериодНачало = ДатаНачалаПериодаДействия;
			Движение.БазовыйПериодКонец = КонецДня(ДатаОкончанияПериодаДействия);
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			СуммаНачисления = ВыборкаДетальныеЗаписи.СуммаПремии;
			Движение.Сумма = СуммаНачисления;
			
			// регистр ВКМ_Удержания
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = ДатаНачалаПериодаДействия;
			Движение.ПериодДействияКонец = КонецДня(ДатаОкончанияПериодаДействия);
			Движение.БазовыйПериодНачало = ДатаНачалаПериодаДействия;
			Движение.БазовыйПериодКонец = КонецДня(ДатаОкончанияПериодаДействия);
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение.Сумма = окр(СуммаНачисления * Константы.ВКМ_НДФЛ.Получить() / 100, 2, РежимОкругления.Окр15как20);
		КонецЦикла;
		
		Движения.ВКМ_ДополнительныеНачисления.Записать();
		Движения.ВКМ_Удержания.Записать();
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Сумма, 0) - ЕСТЬNULL(ВКМ_УдержанияДанныеГрафика.Сумма, 0)) КАК Сумма
		|ИЗ
		|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания.ДанныеГрафика(Регистратор = &Ссылка) КАК ВКМ_УдержанияДанныеГрафика
		|		ПО ВКМ_ДополнительныеНачисления.Сотрудник = ВКМ_УдержанияДанныеГрафика.Сотрудник
		|ГДЕ
		|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ДополнительныеНачисления.Сотрудник";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.Период = КонецДня(Дата);
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			Движение.Сумма = ВыборкаДетальныеЗаписи.Сумма;			
		КонецЦикла;
		
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		//Данный фрагмент построен конструктором.
		//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
		
		
		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры
	#КонецОбласти
	
#КонецЕсли
